In [2]:
import numpy as np
import pandas as pd

# Pandas - DataFrame
* 多维选择
* 安全选择
* 不安全选择
* Index操作

## 多维选择
* 使用column选择
* 使用index选择
* 使用位置选择
* 综合选择
* 条件选择

In [4]:
df=pd.DataFrame({'apples':pd.Series([3,2,0,1]),
'oranges':pd.Series([0,3,7,2]),
             'cherry':[6,8,2,5]})
df

   apples  oranges  cherry
0       3        0       6
1       2        3       8
2       0        7       2
3       1        2       5

### 使用column选择

In [6]:
df[['apples','oranges']]

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

### 使用index选择

In [8]:
df.loc[[0,2]]

   apples  oranges  cherry
0       3        0       6
2       0        7       2

In [10]:
df.loc[1:2]

   apples  oranges  cherry
1       2        3       8
2       0        7       2

In [15]:
idx=[True,True,False,False]
df.loc[idx]

   apples  oranges  cherry
0       3        0       6
1       2        3       8

In [16]:
df[idx]

   apples  oranges  cherry
0       3        0       6
1       2        3       8

### 使用位置选择

In [19]:
df.iloc[:3:2]

   apples  oranges  cherry
0       3        0       6
2       0        7       2

### 综合选择

In [20]:
df.loc[1:3,['apples','oranges']]

   apples  oranges
1       2        3
2       0        7
3       1        2

In [21]:
df.loc[[0,3],['apples','oranges']]

   apples  oranges
0       3        0
3       1        2

### 条件选择 - 最常用的方法

In [22]:
df

   apples  oranges  cherry
0       3        0       6
1       2        3       8
2       0        7       2
3       1        2       5

In [24]:
df['apples']>1

0     True
1     True
2    False
3    False
Name: apples, dtype: bool

In [27]:
df[df['apples']>1][['apples','cherry']]

   apples  cherry
0       3       6
1       2       8

In [28]:
df[df['apples']>1].iloc[0]

apples     3
oranges    0
cherry     6
Name: 0, dtype: int64

In [29]:
df['apples'].gt(1)

0     True
1     True
2    False
3    False
Name: apples, dtype: bool

In [30]:
df[df['apples'].gt(1)]

   apples  oranges  cherry
0       3        0       6
1       2        3       8

In [31]:
df['apples'].isin([1,3])

0     True
1    False
2    False
3     True
Name: apples, dtype: bool

In [32]:
df[df['apples'].isin([1,3])]

   apples  oranges  cherry
0       3        0       6
3       1        2       5

In [33]:
df

   apples  oranges  cherry
0       3        0       6
1       2        3       8
2       0        7       2
3       1        2       5

In [37]:
(df['apples']>=1) | (df['oranges']<3)

0     True
1     True
2    False
3     True
dtype: bool

In [36]:
df[(df['apples']>=1) | (df['oranges']<3)]

   apples  oranges  cherry
0       3        0       6
1       2        3       8
3       1        2       5

## 不安全选择

In [38]:
df

   apples  oranges  cherry
0       3        0       6
1       2        3       8
2       0        7       2
3       1        2       5

In [39]:
df['apples']

0    3
1    2
2    0
3    1
Name: apples, dtype: int64

In [40]:
df

   apples  oranges  cherry
0       3        0       6
1       2        3       8
2       0        7       2
3       1        2       5

In [41]:
df[['apples','cherry']]

   apples  cherry
0       3       6
1       2       8
2       0       2
3       1       5

In [42]:
df[['apples','oranges','cherry']]

   apples  oranges  cherry
0       3        0       6
1       2        3       8
2       0        7       2
3       1        2       5

In [44]:
df[['apples']]

   apples
0       3
1       2
2       0
3       1

## 安全选择

In [45]:
df['apples']

0    3
1    2
2    0
3    1
Name: apples, dtype: int64

In [46]:
df[['apples']]

   apples
0       3
1       2
2       0
3       1

In [47]:
df.loc[0]

apples     3
oranges    0
cherry     6
Name: 0, dtype: int64

In [48]:
df.loc[[0]]

   apples  oranges  cherry
0       3        0       6

## Index 操作

In [49]:
df

   apples  oranges  cherry
0       3        0       6
1       2        3       8
2       0        7       2
3       1        2       5

In [51]:
df.set_index('apples',inplace=True)
df

        oranges  cherry
apples
3             0       6
2             3       8
0             7       2
1             2       5

In [52]:
df.reindex([0,1,2,3,4,5])

        oranges  cherry
apples
0           7.0     2.0
1           2.0     5.0
2           3.0     8.0
3           0.0     6.0
4           NaN     NaN
5           NaN     NaN

In [55]:
df

        oranges  cherry
apples
3             0       6
2             3       8
0             7       2
1             2       5

In [54]:
df.reset_index()

   apples  oranges  cherry
0       3        0       6
1       2        3       8
2       0        7       2
3       1        2       5

### 课后练习

In [ ]:
df = pd.DataFrame({
    'ticker': ['AAPL', 'AAPL', 'MSFT', 'IBM', 'YHOO'],
    'date': ['2015-12-30', '2015-12-31', '2015-12-30', '2015-12-30', '2015-12-30'],
    'open': [426.23, 427.81, 42.3, 101.65, 35.53]
})

对所有ticker是AAPL的行，选择date和open

通过df新建一个df1，df1以ticker作为index

通过df1新建一个df2，以date作为index

通过index 排序df2，递增排序